{
  "name": "dariodev/themelia",
  "version": "0.1.4",
  "libraries": {
    "xv": "^1.1.25"
  },
  "title": "Themelia",
  "branch": "",
  "style": {
    "name": "Swiss",
    "componentSet": {
      "nav": "nav/BasicNav",
      "header": "header/SwissHeader",
      "article": "article/SwissArticle",
      "footer": "footer/BasicFooter"
    },
    "fontFamily": "\"Helvetica Neue\", Helvetica, Arial, sans-serif",
    "heading": {
      "fontWeight": 700,
      "letterSpacing": "-0.01em"
    },
    "layout": {
      "fluid": true
    },
    "colors": {
      "text": "#000",
      "background": "#fff",
      "primary": "#05a",
      "secondary": "#444",
      "highlight": "#f30",
      "border": "#ccc",
      "muted": "#eee"
    }
  },
  "content": [
    {
      "component": "nav",
      "links": [
        {
          "href": "http://relishpress.com/themes/themelia",
          "text": "RelishPress"
        },
        {
          "href": "https://github.com/dariodev/themelia",
          "text": "GitHub"
        }
      ]
    },
    {
      "component": "header",
      "heading": "Themelia",
      "subhead": " Coded to perfection & built to last",
      "children": [
        {
          "component": "ui/TweetButton",
          "text": "themelia:  [WordPress] Development version of Themelia theme. For the latest stable version go to wp.org Theme Directory https://wordpress.org/themes/themelia or visit RelishPress ->",
          "url": "http://relishpress.com/themes/themelia"
        },
        {
          "component": "ui/GithubButton",
          "user": "dariodev",
          "repo": "themelia"
        }
      ],
      "slug": "A WordPress Theme",
      "text": "Development version of Themelia theme. For the latest stable version go to Theme Directory https://wordpress.org/themes/themelia or visit RelishPress.com"
    },
    {
      "component": "article",
      "metadata": {
        "source": "github.readme"
      },
      "html": "\n<p>Author: dariodev<br>Requires at least: WordPress 4.7<br>Tested up to: WordPress 4.9<br>Version: 1.2.0<br>License: <a href=\"http://www.gnu.org/licenses/gpl-2.0.html\">GPLv2</a> or later<br>Tags: one-column, two-columns, right-sidebar, left-sidebar, full-width-template, custom-menu, custom-colors, footer-widgets, editor-style, sticky-post, threaded-comments, translation-ready, featured-images, theme-options, e-commerce, blog</p>\n<h2>Description</h2>\n<p>Welcome to Themelia, a meticulously crafted and balanced WordPress theme for personal and professional blogging. Designed for authors, freelancers, agencies and everyone else. Supports WooCommerce, Easy Digital Downloads, Jetpack modules including Contact form and Infinite Scroll, Contact Form 7 and other popular plugins. Themelia has custom theme settings based on WordPress Customizer to change theme layout, colors, Google Fonts and much more. Typographic hierarchy and balance is established with the use of the modular scale. You can select different scales for different screen sizes. Themelia is built with search-engine optimization (SEO) in mind. It has consistent syntax structure, it&apos;s HTML5 valid, optimized for speed and SEO, utilizing most current HTML5 conventions and <a href=\"http://schema.org\">Schema.org</a> microdata. The theme is built on the rock-solid HybridCore theme framework.</p>\n<h3>Features</h3>\n<p>Responsive Layout, Classic Menu, Mobile Menu, Social Menu, Breadcrumb Navigation, Featured Images, Custom Colors, Theme Options, Modular Scale Typography, Google Fonts, Post Formats</p>\n<h2>Theme Options - Customizer</h2>\n<p>The Customizer allows you to preview changes to your site before publishing them.</p>\n<h3>Site Identity</h3>\n<ul>\n<li>Site Title and Description - change / show / hide</li>\n<li>Logo - Upload image for site logo</li>\n<li>Site Icon (used as a browser and app icon)</li>\n</ul>\n<h3>Site Title and Header</h3>\n<ul>\n<li><strong>Header Layout</strong> - Select layout for header elements (branding and main navigation). Stacked: left aligned, right aligned, centered. Inline: logo-&gt;menu, menu-&gt;logo.</li>\n<li><strong>Site Header Background</strong> - Background color for header area and <strong>Site Header Separator</strong> (Thin border between Site Header and Content Area).</li>\n<li><strong>Site Title and Description</strong> - Color and Size for Site Title and Tagline (Site Description). This is shown according to settings in the Site Identity. If you add site logo, Site Title and Tagline will hide, but always available for screen readers.</li>\n</ul>\n<h3>Main navigation</h3>\n<ul>\n<li><strong>Main Navigation Typography</strong> - Select Font family, size and other attributes.</li>\n<li><strong>Main Navigation Colors</strong> - Colors for top level links and dropdowns.</li>\n</ul>\n<h3>Body Text and Links</h3>\n<ul>\n<li><strong>Body Text (Base typography settings.)</strong> - Font Family, text and links color. <strong>Default Font Family is Roboto.</strong></li>\n</ul>\n<h3>Text Size - Modular Scale</h3>\n<p>A modular scale is a sequence of numbers that relate to one another in a meaningful way. You can set different base font and different modular scale for <strong>Large screens</strong> (desktops), <strong>Mediums screens</strong> (tablets and other medium size devices) and <strong>Small screens</strong> (smartphones and other small devices).<br> This theme provides four scales, Major Second, Minor Third, Major Third and Perfect Fourth.<br> Find more about the concept of <a href=\"http://alistapart.com/article/more-meaningful-typography\">modular scale</a>, also check <a href=\"http://www.modularscale.com/\">Modular Scale calculator</a> and <a href=\"http://type-scale.com/\">Type Scale</a>.</p>\n<h3>Headings, Entry Titles &amp; Widget Title</h3>\n<ul>\n<li>Color, weight, transform and letter spacing for <strong>entry titles</strong>, content <strong>headings</strong> and <strong>sidebar widget titles</strong>.</li>\n</ul>\n<h3>Breadcrumbs &amp; Secondary Text</h3>\n<ul>\n<li><strong>Display Breadcrumbs</strong> - on/off</li>\n<li><strong>Secondary Text</strong> - Text size for breadcrumbs.</li>\n<li><strong>Secondary Text</strong> - Size and color for entry meta, date, time, Read More link.</li>\n</ul>\n<h3>Blog Settings</h3>\n<ul>\n<li><strong>Hide author name from Post Excerpt and/or Single Post</strong></li>\n<li><strong>Comments Link</strong> - Change the look of the comments link (textual link or icons). Show/hide on Post Excerpt and/or Single Post.</li>\n<li><strong>Excerpt or Full Post Content</strong> - Switch between displaying Excerpts or Full Content. Applies to the normal post format on the blog page, archives and search results.<ul>\n<li><strong>Excerpts (Default):</strong> Use auto excerpt or manual excerpt. To manually add an excerpt to a post, simply write one in the Excerpt field under the post edit box. An excerpt can be as short or as long as you wish. When a post has no manual excerpt WordPress generates an excerpt automatically by selecting the first 55 words of the post.</li>\n<li><strong>Content:</strong> The full post content will be displayed, optionally you may use the More tag to create a teaser from the content that precedes the More tag.</li>\n</ul>\n</li>\n</ul>\n<h3>Layout</h3>\n<ul>\n<li><strong>Global Layout</strong> - (2 columns - sidebar / content, 2 columns - content / sidebar, 1 column content). You can override this per page/post basis.</li>\n<li><strong>Footer Widgets</strong> - Choose the number of widget columns in the footer widget area. Each column can have any number of widgets.</li>\n</ul>\n<h3>Background</h3>\n<ul>\n<li><strong>Background Color</strong> - Pick body background color.</li>\n<li><strong>Background Image</strong> - Upload/Select body background image.</li>\n</ul>\n<h3>Secondary Colors</h3>\n<ul>\n<li>Colors for separators and horizontal lines</li>\n</ul>\n<h3>Menus</h3>\n<p>This panel is used for managing Navigation Menus for content you have already published on your site. You can create menus and add items for existing content such as pages, posts, categories, tags, formats, or custom links. Menus can be displayed in locations defined by the theme or in widget areas by adding a &quot;Custom Menu&quot; widget.</p>\n<p><em>This theme uses Navigation Menus <code>wp_nav_menu()</code> in three locations. Primary, Footer - Left and Footer - Right.</em></p>\n<p><strong>Locations:</strong></p>\n<ul>\n<li><strong>Primary</strong> Placed in the top header. For the Main site navigation.</li>\n<li><strong>Footer - Left</strong> Placed in the left footer. This is a one level menu (no dropdowns).</li>\n<li><strong>Footer - Right - (optionally social menu)</strong> Placed in the right footer. You can use it as a regular menu or as a Social Links menu. Inputting a custom link to your social profile the menu item will automatically display an icon for that social network (icons are provided by Ionicons icon font). To hide textual part of the link and display only the icon, add &quot;icon-only&quot; class to each menu item. If you add &quot;icon-only&quot; class, text will be visually hidden, but still available for screen readers. This is a one level menu (no dropdowns).</li>\n</ul>\n<h3>Widgets</h3>\n<p>Theme has five widget areas:</p>\n<ul>\n<li><strong>Primary sidebar</strong> - The main sidebar. It is displayed on either the left or right side of the page based on the chosen layout.</li>\n<li><strong>Subsidiary sidebar</strong> - A sidebar located in the upper footer of the site. Optimized for one wide widget (and multiples thereof).</li>\n<li><strong>Footer Widgets</strong> - An area optimized for one, two, three or four widgets (and multiples thereof). Each column can have any number of widgets.</li>\n<li><strong>Colophon sidebar</strong> - Widget added in this sidebar will replace default theme copyright line in the site footer. Optimized for one widget. Best use: Text Widget (or similar) with auto paragraph and without title.</li>\n<li><strong>Colophon Right sidebar</strong> - A widget area located in the bottom-right footer of the site. Optimized for one widget.</li>\n</ul>\n<h3>Static Front Page</h3>\n<p>This theme supports a static front page.</p>\n<h2>Installation</h2>\n<ol>\n<li>In your admin panel, go to Appearance -&gt; Themes and click the &apos;Add New&apos; button.</li>\n<li>Type in Themelia in the search form and press the &apos;Enter&apos; key on your keyboard.</li>\n<li>Click on the &apos;Activate&apos; button to use your new theme right away.</li>\n<li>Navigate to Appearance &gt; Customize in your admin panel and customize to taste.</li>\n</ol>\n<p>For more information about Themelia please go to <a href=\"https://relishpress.com/\">RelishPress website</a>.</p>\n<h2>Notes for developers</h2>\n<p><em>HybridCore*</em></p>\n<ul>\n<li>Added attributes for all layout elements (<code>hybrid_attr()</code>).  Schema.org is defined as a default.  The change is in the <code>functions-attr.php</code> file.</li>\n</ul>\n<p><strong>Kirki Toolkit modification (original version is 2.3.7)</strong></p>\n<ul>\n<li>Removed CodeMirror to reduce the size</li>\n<li>Changed text-domain, from &apos;kirki&apos; into &apos;themelia&apos;</li>\n<li>Removed enqueuing empty kirki-styles-. Changed $handle parameter in <code>wp_add_inline_style()</code>, added inline &apos;themelia-style&apos;. The change is in the file &quot;class-kirki-styles-frontend.php&quot;.</li>\n</ul>\n<p><strong>Unsemantic CSS Framework</strong></p>\n<ul>\n<li>Media queries breakpoints slightly modifed</li>\n<li>Grid container width and grid paddings modified</li>\n</ul>\n<h2>Copyright and License</h2>\n<p>Themelia WordPress Theme, Copyright 2016 - 2017 Dario Devcic<br>Themelia is distributed under the terms of the GNU GPL</p>\n<p>This program is free software: you can redistribute it and/or modify<br>it under the terms of the GNU General Public License as published by<br>the Free Software Foundation, either version 2 of the License, or<br>(at your option) any later version.</p>\n<p>This program is distributed in the hope that it will be useful,<br>but WITHOUT ANY WARRANTY; without even the implied warranty of<br>MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the<br>GNU General Public License for more details.</p>\n<h3>Third Party Resources</h3>\n<p><a href=\"http://themehybrid.com/hybrid-core\"><strong>HybridCore</strong></a> v4.0.0, Copyright (c) 2008 - 2017, Justin Tadlock<br>License: GNU GPL, Version 2 (or later)</p>\n<p><a href=\"http://kirki.org/\"><strong>Kirki Toolkit</strong></a> v3.0.10, Copyright (c) 2017, Aristeides Stathopoulos<br>Licenses: MIT/GPL2</p>\n<p><a href=\"http://ionicons.com/\"><strong>Ionicons</strong></a> icon font v3.0.0-alpha.3, Copyright (c) 2016, Drifty<br>License: MIT</p>\n<p><a href=\"http://unsemantic.com/\"><strong>Unsemantic CSS Framework</strong></a>, Created by Nathan Smith<br>Licenses: MIT/GPL</p>\n<p><a href=\"https://www.smartmenus.org/\"><strong>SmartMenus jQuery Plugin</strong></a> v1.0.1, Copyright 2016 Vasil Dinkov, Vadikom Web Ltd.<br>Licenses: MIT</p>\n<p><a href=\"http://fitvidsjs.com/\"><strong>FitVids</strong></a> v1.1, Copyright 2013, Chris Coyier<br>License: <a href=\"http://sam.zoy.org/wtfpl/\">WTFPL</a></p>\n<p><strong>HTML5 Shiv</strong> v3.7.0, Copyright 2014 Alexander Farkas<br>Licenses: MIT/GPL2</p>\n<p>All jQuery plugins are minified. Full source versions are also bundled in theme package. Full source versions will be loaded if <code>SCRIPT_DEBUG</code> is set to <code>TRUE</code> in your <code>wp-config.php</code> file. Otherwise, the <code>*.min.css</code> file is loaded.</p>\n<p><strong>Image used in screenshot.png</strong></p>\n<ul>\n<li>Featured image by <a href=\"https://unsplash.com/@reddangelo16?photo=eY7ETwocMyU\">Redd Angelo</a>, licensed under <a href=\"http://creativecommons.org/publicdomain/zero/1.0/\">Creative Commons Zero</a></li>\n</ul>\n<p>All other resources and theme elements are licensed under the <a href=\"http://www.gnu.org/licenses/old-licenses/gpl-2.0.html\">GNU GPL</a>, version 2 or later.</p>\n"
    },
    {
      "component": "footer",
      "links": [
        {
          "href": "https://github.com/dariodev/themelia",
          "text": "GitHub"
        },
        {
          "href": "https://github.com/dariodev",
          "text": "dariodev"
        }
      ]
    }
  ]
}